import numpy as np
#사진 찍어서 ai한테 칠판 침해율좀 봐달라 하기, 아예 랜덤인 자리 배치와 비교하여 얼마나 개선되었는지도 
clasroom = [
    [0,0,0, 714,872,266], # 교실 전체 크기
    [320,92,0, 440,152,89], # 교탁
    [] # 기타등등?
]

plate = [207,0,89, 498, 0, 217]#칠판 크기

 #실측정 값 필요함esk_lst = [ #실측정 값 필요함]
desk_lst_highbad = [ #8자리
    [120,312],
    [120,432],
    [200,312],
    [200,432],
    [520,312],
    [520,432],
    [600,312],
    [600,432],
]

desk_lst_shortbad = [ #6자리
    [120,192],
    [200,192],
    [320,192],
    [400,192],
    [520,192],
    [600,192]
]

desk_lst_highgood = [ #10자리
    [192,552],
    [192,672],
    [200,552],
    [200,672],
    [320,672],
    [400,672],
    [520,552],
    [520,672],
    [600,552],
    [600,672]
]

desk_lst_shortgood = [ #6자리
    [320,312],
    [320,432],
    [320,552],
    [400,312],
    [400,432],
    [400,552],
]

stdnt_dict = {

}

stdnteye_dict = {

}



desk_lst_high_name = []

desk_lst_short_name = []

desk_lst_highbad_name = []

desk_lst_shortbad_name = []

desk_lst_highgood_name = []

desk_lst_shortgood_name = []