import numpy as np
#사진 찍어서 ai한테 칠판 침해율좀 봐달라 하기, 아예 랜덤인 자리 배치와 비교하여 얼마나 개선되었는지도 
clasroom = [
    [0,0,0, 716,878,266], # 교실 전체 크기
    [277,89,0, 397,149,100], # 교탁
    [] # 기타등등?
]

plate = [82,0,89, 619, 0, 216]#칠판 크기

 #실측정 값 필요함esk_lst = [ #실측정 값 필요함]
desk_lst_highbad = [ #8자리
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
]

desk_lst_shortbad = [ #6자리
    [],
    [],
    [],
    [],
    [],
    []
]

desk_lst_highgood = [ #10자리
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    []
]

desk_lst_shortgood = [ #6자리
    [],
    [],
    [],
    [],
    [],
    [],
]

stdnt_dict = {
    "fhah":156,
    "djed":234
}

stdnteye_dict = {
    "강민준": 1,
    "고은아": 0,
    "구자욱": 0,
    "권지용": 1,
    "김도현": 0,
    "김서연": 1,
    "김우빈": 1,
    "김하은": 0,
    "노민우": 0,
    "도경수": 1,
    "문채원": 1,
    "박보검": 0,
    "박서준": 1,
    "박지민": 0,
    "배수지": 1,
    "백현우": 0,
    "서강준": 0,
    "성시경": 1,
    "손예진": 1,
    "송중기": 0,
    "신세경": 0,
    "안효섭": 1,
    "양세종": 0,
    "오연서": 1,
    "유재석": 1,
    "윤아름": 0,
    "이도현": 1,
    "이지은": 0,
    "장원영": 0,
    "한소희": 1
}



desk_lst_high_name = []

desk_lst_short_name = []

desk_lst_highbad_name = []

desk_lst_shortbad_name = []

desk_lst_higgood_name = []

desk_lst_shortgood_name = []